reports/lab3/k6-c1.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: -
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 1 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
default   [   2% ] 1 VUs  0m01.0s/1m0s

running (0m02.0s), 1/1 VUs, 23 complete and 0 interrupted iterations
default   [   3% ] 1 VUs  0m02.0s/1m0s

running (0m03.0s), 1/1 VUs, 35 complete and 0 interrupted iterations
default   [   5% ] 1 VUs  0m03.0s/1m0s

running (0m04.0s), 1/1 VUs, 48 complete and 0 interrupted iterations
default   [   7% ] 1 VUs  0m04.0s/1m0s

running (0m05.0s), 1/1 VUs, 61 complete and 0 interrupted iterations
default   [   8% ] 1 VUs  0m05.0s/1m0s

running (0m06.0s), 1/1 VUs, 73 complete and 0 interrupted iterations
default   [  10% ] 1 VUs  0m06.0s/1m0s

running (0m07.0s), 1/1 VUs, 85 complete and 0 interrupted iterations
default   [  12% ] 1 VUs  0m07.0s/1m0s

running (0m08.0s), 1/1 VUs, 94 complete and 0 interrupted iterations
default   [  13% ] 1 VUs  0m08.0s/1m0s

running (0m09.0s), 1/1 VUs, 106 complete and 0 interrupted iterations
default   [  15% ] 1 VUs  0m09.0s/1m0s

running (0m10.0s), 1/1 VUs, 118 complete and 0 interrupted iterations
default   [  17% ] 1 VUs  0m10.0s/1m0s

running (0m11.0s), 1/1 VUs, 130 complete and 0 interrupted iterations
default   [  18% ] 1 VUs  0m11.0s/1m0s

running (0m12.0s), 1/1 VUs, 142 complete and 0 interrupted iterations
default   [  20% ] 1 VUs  0m12.0s/1m0s

running (0m13.0s), 1/1 VUs, 155 complete and 0 interrupted iterations
default   [  22% ] 1 VUs  0m13.0s/1m0s

running (0m14.0s), 1/1 VUs, 167 complete and 0 interrupted iterations
default   [  23% ] 1 VUs  0m14.0s/1m0s

running (0m15.0s), 1/1 VUs, 179 complete and 0 interrupted iterations
default   [  25% ] 1 VUs  0m15.0s/1m0s

running (0m16.0s), 1/1 VUs, 191 complete and 0 interrupted iterations
default   [  27% ] 1 VUs  0m16.0s/1m0s

running (0m17.0s), 1/1 VUs, 204 complete and 0 interrupted iterations
default   [  28% ] 1 VUs  0m17.0s/1m0s

running (0m18.0s), 1/1 VUs, 215 complete and 0 interrupted iterations
default   [  30% ] 1 VUs  0m18.0s/1m0s

running (0m19.4s), 1/1 VUs, 226 complete and 0 interrupted iterations
default   [  32% ] 1 VUs  0m19.0s/1m0s

running (0m20.9s), 1/1 VUs, 238 complete and 0 interrupted iterations
default   [  33% ] 1 VUs  0m20.0s/1m0s

running (0m21.9s), 1/1 VUs, 250 complete and 0 interrupted iterations
default   [  35% ] 1 VUs  0m21.0s/1m0s

running (0m22.9s), 1/1 VUs, 263 complete and 0 interrupted iterations
default   [  37% ] 1 VUs  0m22.0s/1m0s

running (0m23.9s), 1/1 VUs, 275 complete and 0 interrupted iterations
default   [  38% ] 1 VUs  0m23.0s/1m0s

running (0m24.9s), 1/1 VUs, 287 complete and 0 interrupted iterations
default   [  40% ] 1 VUs  0m24.0s/1m0s

running (0m25.9s), 1/1 VUs, 299 complete and 0 interrupted iterations
default   [  42% ] 1 VUs  0m25.0s/1m0s

running (0m26.9s), 1/1 VUs, 312 complete and 0 interrupted iterations
default   [  43% ] 1 VUs  0m26.0s/1m0s

running (0m27.9s), 1/1 VUs, 324 complete and 0 interrupted iterations
default   [  45% ] 1 VUs  0m27.0s/1m0s

running (0m28.9s), 1/1 VUs, 337 complete and 0 interrupted iterations
default   [  47% ] 1 VUs  0m28.0s/1m0s

running (0m29.9s), 1/1 VUs, 349 complete and 0 interrupted iterations
default   [  48% ] 1 VUs  0m29.0s/1m0s

running (0m30.9s), 1/1 VUs, 361 complete and 0 interrupted iterations
default   [  50% ] 1 VUs  0m30.0s/1m0s

running (0m31.9s), 1/1 VUs, 374 complete and 0 interrupted iterations
default   [  52% ] 1 VUs  0m31.0s/1m0s

running (0m32.9s), 1/1 VUs, 387 complete and 0 interrupted iterations
default   [  53% ] 1 VUs  0m32.0s/1m0s

running (0m33.9s), 1/1 VUs, 399 complete and 0 interrupted iterations
default   [  55% ] 1 VUs  0m33.0s/1m0s

running (0m34.9s), 1/1 VUs, 412 complete and 0 interrupted iterations
default   [  57% ] 1 VUs  0m34.0s/1m0s

running (0m35.9s), 1/1 VUs, 424 complete and 0 interrupted iterations
default   [  58% ] 1 VUs  0m35.0s/1m0s

running (0m36.9s), 1/1 VUs, 435 complete and 0 interrupted iterations
default   [  60% ] 1 VUs  0m36.0s/1m0s

running (0m37.9s), 1/1 VUs, 448 complete and 0 interrupted iterations
default   [  62% ] 1 VUs  0m37.0s/1m0s

running (0m38.9s), 1/1 VUs, 460 complete and 0 interrupted iterations
default   [  63% ] 1 VUs  0m38.0s/1m0s

running (0m39.9s), 1/1 VUs, 473 complete and 0 interrupted iterations
default   [  65% ] 1 VUs  0m39.0s/1m0s

running (0m40.9s), 1/1 VUs, 484 complete and 0 interrupted iterations
default   [  67% ] 1 VUs  0m40.0s/1m0s

running (0m41.9s), 1/1 VUs, 497 complete and 0 interrupted iterations
default   [  68% ] 1 VUs  0m41.0s/1m0s

running (0m42.9s), 1/1 VUs, 509 complete and 0 interrupted iterations
default   [  70% ] 1 VUs  0m42.0s/1m0s

running (0m43.9s), 1/1 VUs, 519 complete and 0 interrupted iterations
default   [  72% ] 1 VUs  0m43.0s/1m0s

running (0m44.9s), 1/1 VUs, 531 complete and 0 interrupted iterations
default   [  73% ] 1 VUs  0m44.0s/1m0s

running (0m45.9s), 1/1 VUs, 543 complete and 0 interrupted iterations
default   [  75% ] 1 VUs  0m45.0s/1m0s

running (0m46.9s), 1/1 VUs, 554 complete and 0 interrupted iterations
default   [  77% ] 1 VUs  0m46.0s/1m0s

running (0m47.9s), 1/1 VUs, 567 complete and 0 interrupted iterations
default   [  78% ] 1 VUs  0m47.0s/1m0s

running (0m48.9s), 1/1 VUs, 579 complete and 0 interrupted iterations
default   [  80% ] 1 VUs  0m48.0s/1m0s

running (0m50.3s), 1/1 VUs, 591 complete and 0 interrupted iterations
default   [  82% ] 1 VUs  0m49.0s/1m0s

running (0m51.8s), 1/1 VUs, 604 complete and 0 interrupted iterations
default   [  83% ] 1 VUs  0m50.0s/1m0s

running (0m52.8s), 1/1 VUs, 616 complete and 0 interrupted iterations
default   [  85% ] 1 VUs  0m51.0s/1m0s

running (0m53.8s), 1/1 VUs, 628 complete and 0 interrupted iterations
default   [  87% ] 1 VUs  0m52.0s/1m0s

running (0m54.8s), 1/1 VUs, 641 complete and 0 interrupted iterations
default   [  88% ] 1 VUs  0m53.0s/1m0s

running (0m55.8s), 1/1 VUs, 653 complete and 0 interrupted iterations
default   [  90% ] 1 VUs  0m54.0s/1m0s

running (0m56.8s), 1/1 VUs, 666 complete and 0 interrupted iterations
default   [  92% ] 1 VUs  0m55.0s/1m0s

running (0m57.8s), 1/1 VUs, 678 complete and 0 interrupted iterations
default   [  93% ] 1 VUs  0m56.0s/1m0s

running (0m58.8s), 1/1 VUs, 691 complete and 0 interrupted iterations
default   [  95% ] 1 VUs  0m57.0s/1m0s

running (0m59.8s), 1/1 VUs, 703 complete and 0 interrupted iterations
default   [  97% ] 1 VUs  0m58.0s/1m0s

running (1m00.8s), 1/1 VUs, 716 complete and 0 interrupted iterations
default   [  98% ] 1 VUs  0m59.0s/1m0s

running (1m01.8s), 1/1 VUs, 728 complete and 0 interrupted iterations
default   [ 100% ] 1 VUs  1m00.0s/1m0s


  █ THRESHOLDS 

    predict_failures
    ✓ 'rate<0.01' rate=0.00%

    predict_latency_ms
    ✓ 'p(95)<250' p(95)=97.039215


  █ TOTAL RESULTS 

    checks_total.......: 2187    35.377753/s
    checks_succeeded...: 100.00% 2187 out of 2187
    checks_failed......: 0.00%   0 out of 2187

    ✓ status is 200
    ✓ probability present
    ✓ version reported

    CUSTOM
    predict_failures...............: 0.00%  0 out of 729
    predict_latency_ms.............: avg=84.48933 min=64.992081 med=79.668773 p(95)=97.039215 p(99)=137.25036 max=536.098907

    HTTP
    http_req_duration..............: avg=84.48ms  min=64.99ms   med=79.66ms   p(95)=97.03ms   p(99)=137.25ms  max=536.09ms  
      { expected_response:true }...: avg=84.48ms  min=64.99ms   med=79.66ms   p(95)=97.03ms   p(99)=137.25ms  max=536.09ms  
    http_req_failed................: 0.00%  0 out of 729
    http_reqs......................: 729    11.792584/s

    EXECUTION
    iteration_duration.............: avg=82.3ms   min=65.14ms   med=79.79ms   p(95)=95.3ms    p(99)=126.5ms   max=218.58ms  
    iterations.....................: 729    11.792584/s
    vus............................: 1      min=1        max=1
    vus_max........................: 1      min=1        max=1

    NETWORK
    data_received..................: 188 kB 3.0 kB/s
    data_sent......................: 170 kB 2.7 kB/s



running (1m01.8s), 0/1 VUs, 729 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  1m0s